pikasTech/PikaPython/demo/simulation-rtt-studio-arm2d/stm32f429-qemu/cubemx/cubemx.ioc
#MicroXplorer Configuration settings - do not modify
Extended=true
File.Version=6
GPIO.groupedBy=
KeepUserPlacement=false
Mcu.Family=STM32F4
Mcu.IP0=NVIC
Mcu.IP1=RCC
Mcu.IP2=SYS
Mcu.IPNb=3
Mcu.Name=STM32F429ZITx
Mcu.Package=LQFP144
Mcu.Pin0=VP_SYS_VS_Systick
Mcu.PinsNb=1
Mcu.ThirdPartyNb=0
Mcu.UserConstants=
Mcu.UserName=STM32F429ZITx
MxCube.Version=6.2.0
MxDb.Version=DB.6.0.20
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.ForceEnableDMAVector=true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=false
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32F429ZITx
ProjectManager.FirmwarePackage=STM32Cube FW_F4 V1.26.2
ProjectManager.FreePins=false
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=0x200
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=1
ProjectManager.MainLocation=Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=cubemx.ioc
ProjectManager.ProjectName=cubemx
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=0x400
ProjectManager.TargetToolchain=EWARM V8.32
ProjectManager.ToolChainLocation=
ProjectManager.UnderRoot=false
ProjectManager.functionlistsort=1-SystemClock_Config-RCC-false-HAL-false
RCC.48MHZClocksFreq_Value.Ext=48000000
RCC.AHBCLKDivider.Ext=RCC_SYSCLK_DIV1
RCC.AHBFreq_Value=16000000
RCC.APB1CLKDivider.Ext=RCC_HCLK_DIV1
RCC.APB1Freq_Value=16000000
RCC.APB1TimCLKDivider.Ext=1
RCC.APB1TimFreq_Value.Ext=16000000
RCC.APB2CLKDivider.Ext=RCC_HCLK_DIV1
RCC.APB2Freq_Value=16000000
RCC.APB2TimFreq_Value.Ext=16000000
RCC.ClockType.Ext=RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK|RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2
RCC.ClockTypeHCLK.Ext=RCC_CLOCKTYPE_HCLK
RCC.ClockTypePCLK1.Ext=RCC_CLOCKTYPE_PCLK1
RCC.ClockTypePCLK2.Ext=RCC_CLOCKTYPE_PCLK2
RCC.ClockTypeSysClk.Ext=RCC_CLOCKTYPE_SYSCLK
RCC.CortexFreq_Value=16000000
RCC.Cortex_Div.Ext=SYSTICK_CLKSOURCE_HCLK
RCC.DATA_CACHE_ENABLE.Ext=1
RCC.EXTERNAL_CLOCK_VALUE.Ext=12288000
RCC.EnableExtClockForI2S.Ext=false
RCC.EnableExtClockForSAIA.Ext=false
RCC.EnableExtClockForSAIB.Ext=false
RCC.EnableHSE.Ext=false
RCC.EnableHSERTCDevisor.Ext=false
RCC.EnableLSE.Ext=false
RCC.EnableLSERTC.Ext=false
RCC.EthernetFreq_Value.Ext=16000000
RCC.ExtClockEnable.Ext=false
RCC.FCLKCortexFreq_Value.Ext=16000000
RCC.FLatency.Ext=FLASH_LATENCY_0
RCC.FamilyName=M
RCC.HCLKFreq_Value.Ext=16000000
RCC.HSEState.Ext=RCC_HSE_OFF
RCC.HSEUsed.Ext=0
RCC.HSE_Timout.Ext=100
RCC.HSE_VALUE=25000000
RCC.HSICalibrationValue.Ext=16
RCC.HSIState.Ext=RCC_HSI_ON
RCC.HSIUsed.Ext=1
RCC.HSI_VALUE=16000000
RCC.I2SClockSource.Ext=I2S_CLOCK_PLL
RCC.I2SClocksFreq_Value=96000000
RCC.I2SEnable.Ext=false
RCC.INSTRUCTION_CACHE_ENABLE.Ext=1
RCC.IPParameters=AHBFreq_Value,APB1Freq_Value,APB2Freq_Value,CortexFreq_Value,FamilyName,HSE_VALUE,HSI_VALUE,I2SClocksFreq_Value,LSE_VALUE,LSI_VALUE,PLLCLKFreq_Value,PLLQCLKFreq_Value,RTCFreq_Value,RTCHSEDivFreq_Value,SYSCLKFreq_VALUE,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIOutputFreq_Value,VCOSAIOutputFreq_ValueQ,VCOSAIOutputFreq_ValueR,VcooutputI2S,VcooutputI2SQ
RCC.IWDGEnable.Ext=false
RCC.LCDTFTFreq_Value.Ext=12250000
RCC.LSEState.Ext=RCC_LSE_OFF
RCC.LSEUsed.Ext=0
RCC.LSE_Timout.Ext=5000
RCC.LSE_VALUE=32768
RCC.LSIState.Ext=RCC_LSI_OFF
RCC.LSIUsed.Ext=0
RCC.LSI_VALUE=32000
RCC.LTDCEnable.Ext=false
RCC.MCO1OutPutEnable.Ext=false
RCC.MCO1PinFreq_Value.Ext=16000000
RCC.MCO2OutPutEnable.Ext=false
RCC.MCO2PinFreq_Value.Ext=16000000
RCC.OscillatorType.Ext=RCC_OSCILLATORTYPE_HSI
RCC.OscillatorTypeHSE.Ext=
RCC.OscillatorTypeHSI.Ext=RCC_OSCILLATORTYPE_HSI
RCC.OscillatorTypeLSE.Ext=
RCC.OscillatorTypeLSI.Ext=
RCC.PLLCLKFreq_Value=96000000
RCC.PLLI2SCLKSAIA_BEnable.Ext=false
RCC.PLLI2SDivQ.Ext=1
RCC.PLLI2SN.Ext=192
RCC.PLLI2SQ.Ext=2
RCC.PLLI2SR.Ext=2
RCC.PLLM.Ext=16
RCC.PLLN.Ext=192
RCC.PLLP.Ext=RCC_PLLP_DIV2
RCC.PLLQ.Ext=4
RCC.PLLQCLKFreq_Value=48000000
RCC.PLLSAIDivQ.Ext=1
RCC.PLLSAIDivR.Ext=RCC_PLLSAIDIVR_2
RCC.PLLSAIN.Ext=49
RCC.PLLSAIQ.Ext=4
RCC.PLLSAIR.Ext=2
RCC.PLLSource.Ext=RCC_PLLSOURCE_HSI
RCC.PLLSourceVirtual.Ext=RCC_PLLSOURCE_HSI
RCC.PLLState.Ext=RCC_PLL_OFF
RCC.PLLUsed.Ext=0
RCC.PREFETCH_ENABLE.Ext=1
RCC.PWREXT_OverDrive.Ext=PWREXT_OverDrive_DESACTIVATED
RCC.PWR_Regulator_Voltage_Scale.Ext=PWR_REGULATOR_VOLTAGE_SCALE3
RCC.PeriphClockSelection.Ext=
RCC.RCC_MCO1Source.Ext=RCC_MCO1SOURCE_HSI
RCC.RCC_MCO2Source.Ext=RCC_MCO2SOURCE_SYSCLK
RCC.RCC_MCODiv1.Ext=RCC_MCODIV_1
RCC.RCC_MCODiv2.Ext=RCC_MCODIV_1
RCC.RCC_PERIPHCLK_I2SVar.Ext=
RCC.RCC_PERIPHCLK_LTDCVar.Ext=
RCC.RCC_PERIPHCLK_RTCVar.Ext=
RCC.RCC_PERIPHCLK_SAI_PLLI2SVar.Ext=
RCC.RCC_PERIPHCLK_SAI_PLLSAIVar.Ext=
RCC.RCC_PERIPHCLK_TIMVar.Ext=
RCC.RCC_RTC_Clock_Source.Ext=RCC_RTCCLKSOURCE_LSE
RCC.RCC_RTC_Clock_Source_FROM_HSE.Ext=RCC_RTCCLKSOURCE_HSE_DIV2
RCC.RCC_TIM_PRescaler_Selection.Ext=RCC_TIMPRES_DESACTIVATED
RCC.RNGEnable.Ext=false
RCC.RTCEnable.Ext=false
RCC.RTCFreq_Value=32000
RCC.RTCHSEDivFreq_Value=12500000
RCC.SAIAEnable.Ext=false
RCC.SAIBEnable.Ext=false
RCC.SAIClockSource_BlockA.Ext=SAI_CLKSOURCE_PLLSAI
RCC.SAIClockSource_BlockB.Ext=SAI_CLKSOURCE_PLLSAI
RCC.SAI_AClocksFreq_Value.Ext=12250000
RCC.SAI_BClocksFreq_Value.Ext=12250000
RCC.SDIOEnable.Ext=false
RCC.SYSCLKFreq_VALUE=16000000
RCC.SYSCLKSource.Ext=RCC_SYSCLKSOURCE_HSI
RCC.USBFSEnable.Ext=false
RCC.USBHSEnable.Ext=false
RCC.VCOI2SOutputFreq_Value=192000000
RCC.VCOInputFreq_Value=1000000
RCC.VCOOutputFreq_Value=192000000
RCC.VCOSAIOutputFreq_Value=49000000
RCC.VCOSAIOutputFreq_ValueQ=12250000
RCC.VCOSAIOutputFreq_ValueR=24500000
RCC.VDD_VALUE.Ext=3.3
RCC.VcooutputI2S=96000000
RCC.VcooutputI2SQ=96000000
RCC.WatchDogFreq_Value.Ext=32000
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
board=custom
